{"links":{"Poll: Sanders, Ward peak as top QB draft options":{"cnt":1,"title":"Poll: Sanders, Ward peak as top QB draft options","description":"Colorado's Shedeur Sanders and Miami's Cam Ward have separated themselves from the rest of the 2025 draft class for quarterbacks in a follow-up poll of scouts and executives.","content":"ARLINGTON, Texas -- The top of the quarterback market appears to have solidified for the 2025 NFL draft, with an ESPN poll showing that Colorado's Shedeur Sanders and Miami's Cam Ward have separated … [+3358 chars]","sentences":{"prev":["for quarterbacks in a follow-up poll of scouts and"],"next":["Texas -- The top of the quarterback market appears"]}},"Caitlin Clark's Iowa coach says team is now missing leadership after Clark's departure":{"cnt":1,"title":"Caitlin Clark's Iowa coach says team is now missing leadership after Clark's departure","description":"Iowa University's women's basketball head coach Jan Jensen addressed the team's \"lack of senior leadership\" to reporters following Caitlin Clark's departure.","content":"Iowa University's women's basketball team and head coach Jan Jensen are going through their first season without star Caitlin Clark since 2019. \r\nThe Hawkeyes are off to a 12-4 start and are ranked 2… [+2664 chars]","sentences":{"prev":["leadership\" to reporters following Caitlin Clark's"],"next":["University's women's basketball team and head coach Jan"]}},"Industrial routers are being hit by zero-days from new Mirai botnets":{"cnt":1,"title":"Industrial routers are being hit by zero-days from new Mirai botnets","description":"A new botnet, based on the dreaded Mirai, is actively assimilating devices, including smart home gadgets and industrial routers.","content":"<ul><li>Chinese researchers discovered a variant of Mirai with an offensive name</li><li>It targets industrial routers and smart home devices with zero-day flaws, misconfigurations, and poor password… [+2494 chars]","sentences":{"prev":["devices, including smart home gadgets and industrial"],"next":["researchers discovered a variant of Mirai with"]}},"2024 NFL Wild Card odds: Best bets for Chargers-Texans, Broncos-Bills":{"cnt":1,"title":"2024 NFL Wild Card odds: Best bets for Chargers-Texans, Broncos-Bills","description":"Find out why Sammy P is fading the Chargers and why he's backing the Bills to win and cover against the Broncos on Wild Card weekend.","content":"Notre Dame did it again.\r\nWhat a resilient football team that keeps finding ways to win. I do wonder if the Irish have the depth to hang with Ohio State or Texas, but what a fun ride its been for any… [+2520 chars]","sentences":{"prev":["to win and cover against the Broncos on Wild Card"],"next":["Dame did it again.\r\nWhat a resilient football team that"]}},"Mel Gibson loses Malibu mansion to fires while doing Joe Rogan podcast":{"cnt":1,"title":"Mel Gibson loses Malibu mansion to fires while doing Joe Rogan podcast","description":"Mel Gibson wasn't at home when his Malibu mansion burned to the ground in the ongoing Southern California wildfires — he was out of state recording on Joe Rogan's podcast.","content":"Mel Gibson wasn't at home when his Malibu mansion burned to the ground in the ongoing Southern California wildfires he was out of state recording on Joe Rogan's podcast.\r\nThe actor and director made … [+2148 chars]","sentences":{"prev":["— he was out of state recording on Joe Rogan's"],"next":["Gibson wasn't at home when his Malibu mansion burned to the"]}},"Senators vs. Penguins: Live stream, TV info, time and more | January 11, 2025":{"cnt":1,"title":"Senators vs. Penguins: Live stream, TV info, time and more | January 11, 2025","description":"The NHL schedule on Saturday features a matchup between the Ottawa Senators (19-18-3) and the Pittsburgh Penguins (18-17-8), starting at 4:00 PM ET at PPG Paints Arena and broadcast on ESPN+. The S…","content":"The NHL schedule on Saturday features a matchup between the Ottawa Senators (19-18-3) and the Pittsburgh Penguins (18-17-8), starting at 4:00 PM ET at PPG Paints Arena and broadcast on ESPN+. The Sen… [+1690 chars]","sentences":{"prev":["4:00 PM ET at PPG Paints Arena and broadcast on ESPN+. The"],"next":["NHL schedule on Saturday features a matchup between the"]}},"Sabres vs. Kraken: Live stream, TV info, time and more | January 11, 2025":{"cnt":1,"title":"Sabres vs. Kraken: Live stream, TV info, time and more | January 11, 2025","description":"NHL play on Saturday includes the Buffalo Sabres (16-21-5) hosting the Seattle Kraken (17-22-3) at KeyBank Center, starting at 4:00 PM ET on ESPN+. The Sabres are 16th in the Eastern Conference (37…","content":"NHL play on Saturday includes the Buffalo Sabres (16-21-5) hosting the Seattle Kraken (17-22-3) at KeyBank Center, starting at 4:00 PM ET on ESPN+. The Sabres are 16th in the Eastern Conference (37 p… [+1564 chars]","sentences":{"prev":["ET on ESPN+. The Sabres are 16th in the Eastern Conference"],"next":["play on Saturday includes the Buffalo Sabres (16-21-5)"]}},"Who Will Play in Super Bowl LIX? Here's What an AI Supercomputer Predicts":{"cnt":1,"title":"Who Will Play in Super Bowl LIX? Here's What an AI Supercomputer Predicts","description":"Super Bowl LIX will be played on February 9 in New Orleans, with the NFL playoffs starting this weekend.","content":"The NFL playoffs begin this weekend season, and BetVictor Canada is predicting the Kansas City Chiefs will face the Philadelphia Eagles in the Super Bowl.\r\n\"Ahead of this weekend's NFL Wild Card roun… [+5624 chars]","sentences":{"prev":["9 in New Orleans, with the NFL playoffs starting this"],"next":["NFL playoffs begin this weekend season, and BetVictor"]}},"Venezuela Detains Top Opposition Leader, Who Reappears in Bizarre Video":{"cnt":1,"title":"Venezuela Detains Top Opposition Leader, Who Reappears in Bizarre Video","description":"The socialist regime in Venezuela briefly detained opposition leader María Corina Machado amid gunshots on Thursday after she made her first public appearance in months.\nThe post Venezuela Detains Top Opposition Leader, Who Reappears in Bizarre Video appeared…","content":"The socialist regime in Venezuela briefly detained opposition leader María Corina Machado amid gunshots on Thursday after she made her first public appearance in months.\r\nMachado, who leads Venezuela… [+5663 chars]","sentences":{"prev":["Top Opposition Leader, Who Reappears in Bizarre Video"],"next":["socialist regime in Venezuela briefly detained opposition"]}},"Utah F Guenther (lower body) out indefinitely":{"cnt":1,"title":"Utah F Guenther (lower body) out indefinitely","description":"Forward Dylan Guenther, who leads the Utah Hockey Club in goals with 16, was ruled out indefinitely Friday with a lower-body injury.","content":"Jan 10, 2025, 06:28 PM ET\r\nForward Dylan Guenther, who leads the Utah Hockey Club in goals with 16, was ruled out indefinitely Friday with a lower-body injury.\r\nGuenther was hurt Wednesday during Uta… [+865 chars]","sentences":{"prev":["16, was ruled out indefinitely Friday with a lower-body"],"next":["10, 2025, 06:28 PM ET\r\nForward Dylan Guenther, who leads"]}},"Source: Rea reunites with Counsell via Cubs deal":{"cnt":1,"title":"Source: Rea reunites with Counsell via Cubs deal","description":"The Cubs and free-agent RHP Colin Rea have agreed to a one-year, $5 million contract, reuniting the right-hander with manager Craig Counsell, a source told ESPN's Jesse Rogers on Friday.","content":"Jan 10, 2025, 06:23 PM ET\r\nCHICAGO -- The Chicago Cubs and free agent Colin Rea have agreed to a one-year, $5 million contract, reuniting the right-hander with manager Craig Counsell, a source told E… [+1136 chars]","sentences":{"prev":["Craig Counsell, a source told ESPN's Jesse Rogers on"],"next":["10, 2025, 06:23 PM ET\r\nCHICAGO -- The Chicago Cubs and free"]}},"Wife of American detained in Afghanistan heads to Mar-a-Lago to beg Trump to take up prisoner swap":{"cnt":1,"title":"Wife of American detained in Afghanistan heads to Mar-a-Lago to beg Trump to take up prisoner swap","description":"A wife desperate to bring her husband home after two-plus years of wrongful detainment in Afghanistan has flown to Mar-a-Lago to implore President-elect Trump to take up her case.","content":"EXCLUSIVE: A wife desperate to bring her husband home from 2½ years of wrongful detainment in Afghanistan has flown to Mar-a-Lago in Florida to implore President-elect Trump to take up her case. \r\nRy… [+4481 chars]","sentences":{"prev":["to implore President-elect Trump to take up her"],"next":["A wife desperate to bring her husband home from 2½"]}},"California Homeowners Get New Protection From Insurance Cancellations":{"cnt":1,"title":"California Homeowners Get New Protection From Insurance Cancellations","description":"California Insurance Commissioner Ricardo Lara issued a one-year moratorium that protects homeowners' insurance if they live in the areas impacted by wildfires.","content":"California homeowners have one new protection as the Los Angeles wildfires continue to ravage roughly 29,000 acres.\r\nCalifornia Insurance Commissioner Ricardo Lara issued a one-year moratorium that p… [+5003 chars]","sentences":{"prev":["insurance if they live in the areas impacted by"],"next":["homeowners have one new protection as the Los"]}},"Former Democrat Staffer, Adam Kinzinger Lackey Pushes Lies About DNI Nominee Tulsi Gabbard":{"cnt":1,"title":"Former Democrat Staffer, Adam Kinzinger Lackey Pushes Lies About DNI Nominee Tulsi Gabbard","description":"Mouaz Moustafa, a former Democrat congressional aide and current lobbyist who long pushed for U.S.-led regime change in Syria, attempted to smear Tulsi Gabbard, nominee for Director of National Intelligence, in an interview with Politico published online Thur…","content":"Mouaz Moustafa, a former Democrat congressional aide and current lobbyist who long pushed for U.S.-led regime change in Syria, attempted to smear Tulsi Gabbard, nominee for Director of National Intel… [+6571 chars]","sentences":{"prev":["in an interview with Politico published online"],"next":["Moustafa, a former Democrat congressional aide and"]}},"Supreme Court to review Obamacare’s no-cost coverage of cancer screenings, heart statins and HIV drugs | CNN Politics":{"cnt":1,"title":"Supreme Court to review Obamacare’s no-cost coverage of cancer screenings, heart statins and HIV drugs | CNN Politics","description":"The Supreme Court said Friday it will review the constitutionality of the Affordable Care Act’s no-cost coverage mandates for certain preventive care services, putting the landmark health care law in front of the justices again just as President-elect Donald …","content":"The Supreme Court said Friday it will review the constitutionality of the Affordable Care Acts no-cost coverage mandates for certain preventive care services, putting the landmark health care law in … [+1704 chars]","sentences":{"prev":["in front of the justices again just as President-elect Donald"],"next":["Supreme Court said Friday it will review the"]}},"Ohio State’s Heisman winners throughout history":{"cnt":1,"title":"Ohio State’s Heisman winners throughout history","description":"Ohio State’s Heisman winners throughout history","content":"A flyover lead by U.S. Airforce Capt. Kyle Cassady, grandson of former Ohio State Heisman Trophy winner Howard \"Hopalong\" Cassady flies over Ohio Stadium during the National Anthem prior to the NCAA … [+2290 chars]","sentences":{"prev":["State’s Heisman winners throughout"],"next":["flyover lead by U.S. Airforce Capt. Kyle Cassady, grandson of"]}},"Mark Zuckerberg defends Meta's latest pivot in three-hour Joe Rogan interview | TechCrunch":{"cnt":1,"title":"Mark Zuckerberg defends Meta's latest pivot in three-hour Joe Rogan interview | TechCrunch","description":"Meta CEO Mark Zuckerberg defended his decision to scale back Meta's content moderation policies in a Friday appearance on Joe Rogan's podcast. Zuckerberg","content":"Meta CEO Mark Zuckerberg defended his decision to scale back Meta’s content moderation policies in a Friday appearance on Joe Rogan’s podcast. Zuckerberg faced widespread criticism for the decision, … [+5555 chars]","sentences":{"prev":["in a Friday appearance on Joe Rogan's podcast."],"next":["CEO Mark Zuckerberg defended his decision to scale back"]}},"Community desperate for investment welcomes $30m 'game changer'":{"cnt":1,"title":"Community desperate for investment welcomes $30m 'game changer'","description":"Community leaders in Wyndham say the Albanese government's pledge to widen trade at the Kimberley town's port and boost infrastructure is well overdue.","content":"Community leaders in Western Australia's northernmost town have welcomed a $30 million federal government cash splash, with hopes upgrades to Wyndham's town site and port can \"drag it into the 21st c… [+4273 chars]","sentences":{"prev":["Kimberley town's port and boost infrastructure is well"],"next":["leaders in Western Australia's northernmost town have"]}},"Trump makes misguided accusations about California water management amid wildfires":{"cnt":1,"title":"Trump makes misguided accusations about California water management amid wildfires","description":"President-elect Donald Trump has used the devastating Los Angeles wildfires to revisit a policy disagreement with California Gov.","content":"President-elect Donald Trump has used the devastating Los Angeles wildfires to revisit a policy disagreement with California Gov. Gavin Newsom, pushing a series of complaints that experts say are fal… [+5310 chars]","sentences":{"prev":["wildfires to revisit a policy disagreement with California"],"next":["Donald Trump has used the devastating Los"]}},"Cynthia Erivo wants to play Storm from 'X-Men': 'We haven't uncovered how grand she is'":{"cnt":1,"title":"Cynthia Erivo wants to play Storm from 'X-Men': 'We haven't uncovered how grand she is'","description":"'Wicked' star Cynthia Erivo wants to next take flight as Storm from Marvel's X-Men, saying, 'I think we haven't uncovered how grand she is, and all of that inner turmoil that she has.'","content":"After playing gravity-defying Elphaba in the blockbuster musical Wicked, Cynthia Erivo wants to next take flight as comic book superhero Storm.\r\nThe actress expressed her interest in playing the weat… [+3327 chars]","sentences":{"prev":["how grand she is, and all of that inner turmoil that she"],"next":["playing gravity-defying Elphaba in the blockbuster"]}},"Giuliani Held in Contempt for Second Time This Week":{"cnt":1,"title":"Giuliani Held in Contempt for Second Time This Week","description":"Rudy Giuliani was held in contempt of court twice this week. On Friday a second judge found him in contempt for continuing to defame Ruby Freeman and Shaye Moss. His legal drama continues next week, and Trump can’t pardon him.","content":"Rudy Giuliani has to be setting some kind of record for legal drama. At the very least, he has to be the only former New York mayor to be held in contempt of court twice in one week.\r\nGiulianis curre… [+2995 chars]","sentences":{"prev":["legal drama continues next week, and Trump can’t pardon"],"next":["Giuliani has to be setting some kind of record for legal"]}},"Hollywood History Up in Flames: Iconic mansion destroyed in LA wildfires":{"cnt":1,"title":"Hollywood History Up in Flames: Iconic mansion destroyed in LA wildfires","description":"A tragic chapter unfolded in Los Angeles history as the Andrew McNally House, a mansion steeped in over a century of cinematic and cultural significance, was destroyed in the ragin","content":"A tragic chapter unfolded in Los Angeles history as the Andrew McNally House, a mansion steeped in over a century of cinematic and cultural significance, was destroyed in the raging wildfires consumi… [+1795 chars]","sentences":{"prev":["cinematic and cultural significance, was destroyed in the"],"next":["tragic chapter unfolded in Los Angeles history as the Andrew"]}},"Draymond Green on Derrick Rose: \"If you win a MVP in the NBA, you're a HOFer\"":{"cnt":1,"title":"Draymond Green on Derrick Rose: \"If you win a MVP in the NBA, you're a HOFer\"","description":"Derrick Rose has been one of the most impactful and loved figures in NBA recent history, earning admiration from fans and players alike. \n\nHis remarkable journey, from being the yo","content":"Derrick Rose has been one of the most impactful and loved figures in NBA recent history, earning admiration from fans and players alike. \r\nHis remarkable journey, from being the youngest MVP in leagu… [+1954 chars]","sentences":{"prev":["and players alike. \n\nHis remarkable journey, from being the"],"next":["Rose has been one of the most impactful and loved"]}},"Breitbart Business Digest: The Fed's View of the Economy Is Burning":{"cnt":1,"title":"Breitbart Business Digest: The Fed's View of the Economy Is Burning","description":"The Federal Reserve's reputation may not be burning down as rapidly as Los Angeles, but the outcome is likely to be the same: rubble, ashes, recriminations, and an expensive rebuilding.\nThe post Breitbart Business Digest: The Fed’s View of the Economy Is Burn…","content":"The December Jobs Report Highlights the Fed’s Mistake\r\nThe Federal Reserve’s reputation may not be burning down as rapidly as Los Angeles, but the outcome is likely to be the same: rubble, ashes, rec… [+4575 chars]","sentences":{"prev":["Business Digest: The Fed’s View of the Economy Is"],"next":["December Jobs Report Highlights the Fed’s Mistake\r\nThe"]}},"How to Watch Ohio State vs Texas, Live Stream College Football Playoff Semifinals, TV Channel, Prediction":{"cnt":1,"title":"How to Watch Ohio State vs Texas, Live Stream College Football Playoff Semifinals, TV Channel, Prediction","description":"The No. 6 Ohio State Buckeyes (12-2) square off against the No. 3 Texas Longhorns (13-2) in the Cotton Bowl, a College Football Playoff semifinal.","content":"The No. 6 Ohio State Buckeyes (12-2) square off against the No. 3 Texas Longhorns (13-2) in the Cotton Bowl, a College Football Playoff semifinal at AT&amp;T Stadium with kickoff at 7:30 p.m. ET on F… [+2625 chars]","sentences":{"prev":["in the Cotton Bowl, a College Football Playoff"],"next":["No. 6 Ohio State Buckeyes (12-2) square off against the No."]}},"Joe Biden's Prime-Time Farewell Address: What We Know":{"cnt":1,"title":"Joe Biden's Prime-Time Farewell Address: What We Know","description":"Biden's Oval Office remarks will be televised on January 15.","content":"President Joe Biden is set to deliver a prime-time farewell address on Wednesday night.\r\nWhy It Matters\r\nBiden's farewell address will be his last big opportunity to reach millions of Americans and s… [+2924 chars]","sentences":{"prev":["Oval Office remarks will be televised on January"],"next":["Joe Biden is set to deliver a prime-time farewell"]}},"Trapped Assam miners' leader arrested, rescue operation enters Day 5":{"cnt":1,"title":"Trapped Assam miners' leader arrested, rescue operation enters Day 5","description":"Leader trapped in Assam's flooded coal mine arrested; dewatering of 340ft-shaft continues with ONGC and Coal India machines. Congress protests illegal coal syndicate, accusing CM Sarma's government of failure, demanding identification and punishment of the sy…","content":"9 exotic wild animals to see inside Kanha National Park, Madhya Pradesh","sentences":{"prev":["of failure, demanding identification and punishment of the"],"next":["exotic wild animals to see inside Kanha National Park, Madhya"]}},"Report: Two Men Shot During Assassination Attempt on Donald Trump to Attend Inauguration":{"cnt":1,"title":"Report: Two Men Shot During Assassination Attempt on Donald Trump to Attend Inauguration","description":"Two men who were shot during the first assassination attempt on President-elect Donald Trump will reportedly attend his upcoming inauguration.\nThe post Report: Two Men Shot During Assassination Attempt on Donald Trump to Attend Inauguration appeared first on …","content":"Two men who were shot during the first assassination attempt on President-elect Donald Trump will reportedly attend his upcoming inauguration.\r\nIn a statement through their attorney, Joseph Feldman, … [+2715 chars]","sentences":{"prev":["on Donald Trump to Attend Inauguration appeared first on"],"next":["men who were shot during the first assassination attempt on"]}},"BookTok shaped a new generation of readers, authors. What happens if TikTok is banned?":{"cnt":1,"title":"BookTok shaped a new generation of readers, authors. What happens if TikTok is banned?","description":"BookTok, the most well-read corner of TikTok, has elevated self-published authors, creators and businesses. Here's the impact a TikTok ban could have.","content":"It doesnt matter if youre off social media or chronically online enough to know what faerie smut is if youre a reader, youve probably heard of BookTok.\r\nReader communities are nothing new. But BookTo… [+7529 chars]","sentences":{"prev":["and businesses. Here's the impact a TikTok ban could"],"next":["doesnt matter if youre off social media or chronically"]}},"Amazon is ‘winding down’ some of its DEI programs":{"cnt":1,"title":"Amazon is ‘winding down’ some of its DEI programs","description":"Amazon is scaling back some of its diversity, equity, and inclusion programs, according to a memo sent to employees last month.","content":"Amazon is winding down some of its DEI programs\r\nAmazon is winding down some of its DEI programs\r\n / A memo sent to Amazon employees said the company is ending outdated programs related to representa… [+5180 chars]","sentences":{"prev":["programs, according to a memo sent to employees last"],"next":["is winding down some of its DEI programs\r\nAmazon is"]}},"On HC nudge, Rajasthan halts training of SIs picked via leak-marred test":{"cnt":1,"title":"On HC nudge, Rajasthan halts training of SIs picked via leak-marred test","description":"JAIPUR: Rajasthan police Friday suspended training of all sub-inspectors and platoon commanders selected through the leak-marred recruitment exam of 2.","content":"Gorgeous pictures of Hansika Motwani","sentences":{"prev":["selected through the leak-marred recruitment exam of"],"next":["pictures of Hansika"]}},"Conservative leader alleges non-citizens may have voted but admits there's no hard evidence":{"cnt":1,"title":"Conservative leader alleges non-citizens may have voted but admits there's no hard evidence","description":"The B.C. Conservatives are calling into question the province's election outcome, alleging — without hard evidence their leader admits — that non-Canadian citizens may have voted.","content":"The B.C. Conservatives are calling into question the province's election outcome, alleging without hard evidence their leader admits that non-Canadian citizens may have voted. \r\nJohn Rustad says he w… [+4977 chars]","sentences":{"prev":["leader admits — that non-Canadian citizens may have"],"next":["B.C. Conservatives are calling into question the province's"]}},"Stephen Curry, Draymond Green out for Warriors vs. Pacers with Knee, Back Injuries":{"cnt":1,"title":"Stephen Curry, Draymond Green out for Warriors vs. Pacers with Knee, Back Injuries","description":"Golden State Warriors starters Stephen Curry (knee) and Draymond Green (back) will sit out Friday's road game against the Indiana Pacers, head coach Steve…","content":"Alex Slitz/Getty Images\r\nGolden State Warriors starters Stephen Curry (knee) and Draymond Green (back) will sit out Friday's road game against the Indiana Pacers, head coach Steve Kerr told reporters… [+2524 chars]","sentences":{"prev":["road game against the Indiana Pacers, head coach"],"next":["Slitz/Getty Images\r\nGolden State Warriors starters Stephen"]}},"I evacuated Los Angeles with my wife and 2 young sons. We're focusing on keeping things as routine as possible and reminding them they're safe.":{"cnt":1,"title":"I evacuated Los Angeles with my wife and 2 young sons. We're focusing on keeping things as routine as possible and reminding them they're safe.","description":"Dr. Joel Warsh is a pediatrician who evacuated with his family during the Los Angeles fires. They're focusing on routine and keeping their kids calm.","content":"The Palisades fire reached homes above the Pacific Coast Highway.MediaNews Group/Orange County Register via Getty Images/MediaNews Group via Getty Images\r\n<ul><li>Dr. Joel Warsh is a pediatrician bas… [+3158 chars]","sentences":{"prev":["fires. They're focusing on routine and keeping their kids"],"next":["Palisades fire reached homes above the Pacific Coast"]}},"Reward for capture of Venezuela's Maduro increased to $25 million":{"cnt":1,"title":"Reward for capture of Venezuela's Maduro increased to $25 million","description":"The increase to $25 million reflects \"the gravity of his crimes and the continued threat he poses,\" a senior official said.","content":"MIAMI - The U.S. Department of State announced Friday it has raised to $25 million the reward for information leading to the arrest or conviction of Venezuelan leader Nicolas Maduro.\r\nReward offered.… [+1901 chars]","sentences":{"prev":["and the continued threat he poses,\" a senior official"],"next":["- The U.S. Department of State announced Friday it has"]}},"10/01/2025 23:01 GMT":{"cnt":1,"title":"10/01/2025 23:01 GMT","description":"The latest five minute news bulletin from BBC World Service.","content":"The latest five minute news bulletin from BBC World Service.","sentences":{"prev":["latest five minute news bulletin from BBC World"],"next":["latest five minute news bulletin from BBC World"]}},"USWNT training camp moved to FL. amid wildfires":{"cnt":1,"title":"USWNT training camp moved to FL. amid wildfires","description":"The United States women's national team's January training camp will now be held in Florida due to the Los Angeles wildfires, U.S. Soccer said on Friday.","content":"The United States women's national team's January training camp has been relocated to Florida due to the Los Angeles wildfires, U.S. Soccer said on Friday.\r\nThe training camp, and the concurrent Futu… [+1429 chars]","sentences":{"prev":["due to the Los Angeles wildfires, U.S. Soccer said on"],"next":["United States women's national team's January training camp"]}},"NFL and teams announce donation of millions to help wildfire victims in Los Angeles region":{"cnt":1,"title":"NFL and teams announce donation of millions to help wildfire victims in Los Angeles region","description":"The NFL community is stepping in to offer millions in financial support to victims of the recent devastating wildfires in the Los Angeles area.","content":"The NFL announced it will donate $5 million for wildfire relief efforts as Southern California continues to battle raging wildfires.\r\n\"Led by individual contributions from clubs and ownership groups … [+3618 chars]","sentences":{"prev":["of the recent devastating wildfires in the Los Angeles"],"next":["NFL announced it will donate $5 million for wildfire relief"]}},"Kardashian Family Evacuates Hidden Hills Homes Amid California Wildfires and Backlash":{"cnt":1,"title":"Kardashian Family Evacuates Hidden Hills Homes Amid California Wildfires and Backlash","description":"Members of the reality TV dynasty have apparently evacuated from their palatial mansions due to the Los Angeles wildfires.","content":"Entertainment gossip and news from Newsweek's network of contributors\r\nSeveral members of the Kardashian family had to evacuate from their homes, most of which are located in the Hidden Hills neighbo… [+2615 chars]","sentences":{"prev":["from their palatial mansions due to the Los Angeles"],"next":["gossip and news from Newsweek's network of"]}},"Milan hope to beat Juventus to Goglichidze":{"cnt":1,"title":"Milan hope to beat Juventus to Goglichidze","description":"Milan are reportedly hoping to beat Juventus to Empoli defender Saba Goglichidze by leaving him on loan for six months.","content":"Milan are reportedly hoping to beat Juventus to Empoli defender Saba Goglichidze by leaving him on loan for six months.\r\nThe Georgia international has impressed since the transfer from Torpedo Kutais… [+1053 chars]","sentences":{"prev":["Saba Goglichidze by leaving him on loan for six"],"next":["are reportedly hoping to beat Juventus to Empoli defender"]}},"These startups are making smarter canes for people with visual impairments | TechCrunch":{"cnt":1,"title":"These startups are making smarter canes for people with visual impairments | TechCrunch","description":"The white cane for the 21st century. While many tech companies have increasingly worked to make technology more accessible for the blind and visually","content":"The white cane for the 21st century. While many tech companies have increasingly worked to make technology more accessible for the blind and visually impaired, canes havent benefitted much from these… [+1766 chars]","sentences":{"prev":["to make technology more accessible for the blind and"],"next":["white cane for the 21st century. While many tech companies"]}},"Calgary residential property values up 15%, says city":{"cnt":1,"title":"Calgary residential property values up 15%, says city","description":"Calgary’s property values increased significantly last year, with residential properties seeing the biggest gains, according to the city’s property assessment department.","content":"Calgary's property values increased significantly last year, with residential properties seeing the biggest gains, according to the city's property assessment department.\r\nSingle family homes excludi… [+2971 chars]","sentences":{"prev":["gains, according to the city’s property assessment"],"next":["property values increased significantly last year,"]}},"Flames' Rasmus Andersson Throws Shade at Oilers, Canucks While Discussing Potential Trade Rumors":{"cnt":1,"title":"Flames' Rasmus Andersson Throws Shade at Oilers, Canucks While Discussing Potential Trade Rumors","description":"The nine-year Flames vet made a passionate statement about his feelings of staying with the team.","content":"The business side of hockey can be a difficult one, especially when a player has spent his entire nine-year NHL career in one place.\r\nThat is how defenseman Rasmus Andersson expressed his feelings to… [+3098 chars]","sentences":{"prev":["statement about his feelings of staying with the"],"next":["business side of hockey can be a difficult one, especially"]}},"More Than 11 Million People Have Watched This Woman Confront Governor Gavin Newsom About The LA Wildfires":{"cnt":1,"title":"More Than 11 Million People Have Watched This Woman Confront Governor Gavin Newsom About The LA Wildfires","description":"\"I would fill up the hydrants myself, but would you do that?\"View Entire Post ›","content":"I immediately approved Governor Newsoms request for a Major Disaster Declaration, allowing folks impacted by the Southern California wildfires to get cash assistance to cover things like groceries an… [+115 chars]","sentences":{"prev":["the hydrants myself, but would you do that?\"View Entire Post"],"next":["immediately approved Governor Newsoms request for a Major"]}},"Guardian Capital Announces Fund Terminations":{"cnt":1,"title":"Guardian Capital Announces Fund Terminations","description":"TORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) — Guardian Capital LP (the “Manager”) today announced that it will terminate GuardPath® Managed Decumulation 2042 Fund (the “Decumulation Fund”) and GuardPath® Modern Tontine 2042 Trust (the “Tontine Trust”, and togethe…","content":"Author of the article:\r\nArticle content\r\nTORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) Guardian Capital LP (the Manager) today announced that it will terminate GuardPath® Managed Decumulation 2042 Fund (th… [+11838 chars]","sentences":{"prev":["Modern Tontine 2042 Trust (the “Tontine Trust”, and"],"next":["of the article:\r\nArticle content\r\nTORONTO, Jan. 10, 2025"]}},"Guardian Capital Announces Increase in Distribution Frequency in respect of certain Guardian Capital Funds":{"cnt":1,"title":"Guardian Capital Announces Increase in Distribution Frequency in respect of certain Guardian Capital Funds","description":"TORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) — Guardian Capital LP announces that commencing in January 2025, the distribution frequency for the Guardian Capital funds listed below (the “Funds”) will increase from quarterly to monthly. Guardian Capital Fund Series…","content":"Author of the article:\r\nArticle content\r\nTORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) Guardian Capital LP announces that commencing in January 2025, the distribution frequency for the Guardian Capital fun… [+8343 chars]","sentences":{"prev":["from quarterly to monthly. Guardian Capital Fund"],"next":["of the article:\r\nArticle content\r\nTORONTO, Jan. 10, 2025"]}},"Gavin Newsom Invites Donald Trump to California Amid Wildfires":{"cnt":1,"title":"Gavin Newsom Invites Donald Trump to California Amid Wildfires","description":"The California governor invited Trump to the fire-ravaged state in a post on Friday afternoon amid intense backlash.","content":"California Governor Gavin Newsom invited President-elect Donald Trump to California in a post on social media on Friday afternoon.\r\nWhy It Matters\r\nNewsom has been under intense backlash amid the dea… [+1271 chars]","sentences":{"prev":["state in a post on Friday afternoon amid intense"],"next":["Governor Gavin Newsom invited President-elect Donald"]}},"REPORT: WR Ryan Wingo to start over WR Isaiah Bond in CFP semifinal Cotton Bowl":{"cnt":1,"title":"REPORT: WR Ryan Wingo to start over WR Isaiah Bond in CFP semifinal Cotton Bowl","description":"Inside Texas tweeted an image of the depth chart from AT&T Stadium ahead of the Cotton Bowl game. It features freshman wide receiver Ryan Wingo listed as starter over junior Isaiah Bond. Bond is sti","content":"Texas Longhorns wide receiver Ryan Wingo (5) fights for yardage against Clemson Tigers linebacker Wade Woodaz (17) in the first half of an NCAA College Football Playoffs first round game at Darrell K… [+1502 chars]","sentences":{"prev":["Wingo listed as starter over junior Isaiah Bond. Bond is"],"next":["Longhorns wide receiver Ryan Wingo (5) fights for yardage"]}},"Trump gets unconditional discharge in hush money case":{"cnt":1,"title":"Trump gets unconditional discharge in hush money case","description":"Trump became the first US president to be sentenced with felony convictions.","content":"Trump became the first US president to be sentenced with felony convictions. The president-elect, appearing remotely via video for the hush-money case, was given an unconditional discharge, which mea… [+119 chars]","sentences":{"prev":["the first US president to be sentenced with felony"],"next":["became the first US president to be sentenced with felony"]}},"These 28 Before And After Pics Will Leave You Shaken, Not Stirred":{"cnt":1,"title":"These 28 Before And After Pics Will Leave You Shaken, Not Stirred","description":"James Bond himself would be ✨ amazed ✨ by these results.View Entire Post ›","content":"This solution works with Keurig, Nespresso, Delonghi, Hamilton Beach, Braun, Bunn, Cuisinart, Tassimo, Krups, Saeco, and other brewing machines!\r\nPromising review: \"I had never even thought of descal… [+650 chars]","sentences":{"prev":["himself would be ✨ amazed ✨ by these results.View Entire Post"],"next":["solution works with Keurig, Nespresso, Delonghi, Hamilton"]}},"Georgia RB Trevor Etienne makes decision for 2025":{"cnt":1,"title":"Georgia RB Trevor Etienne makes decision for 2025","description":"Georgia Bulldogs junior running back Trevor Etienne is reportedly staying with Georgia for 2025 instead of declaring for the NFL draft. He met with head coach Kirby Smart to inform him of his decision. The 2025 college football season will be his last year of…","content":"Georgia running back Trevor Etienne (1) celebrates with his teammates after scoring the game winning touchdown during overtime of the SEC championship game against Texas in Atlanta, on Saturday, Dec.… [+1316 chars]","sentences":{"prev":["The 2025 college football season will be his last year"],"next":["running back Trevor Etienne (1) celebrates with his"]}},"Ex-UFC champ Kamaru Usman goes off on 'stupid welterweights' saying he's ducking":{"cnt":1,"title":"Ex-UFC champ Kamaru Usman goes off on 'stupid welterweights' saying he's ducking","description":"Kamaru Usman is eager for his UFC return – but not until he's healthy.","content":"Kamaru Usman is eager for his UFC return but not until he’s healthy.\r\nAlthough Usman (20-4 MMA, 15-3 UFC) hasn’t competed since a short-notice majority decision loss to middleweight contender Khamzat… [+1988 chars]","sentences":{"prev":["Usman is eager for his UFC return – but not until he's"],"next":["Usman is eager for his UFC return but not until he’s"]}},"NEWSOM ON DEFENSE...":{"cnt":1,"title":"NEWSOM ON DEFENSE...","description":"California Gov. Gavin Newsom (D) called for an independent investigation of the Los Angeles Department Water and Power on Friday amid reported water supply issues during this week’s wildfires.  In a letter addressed to the CEO and chief engineer of the depart…","content":"Skip to content\r\nCalifornia Gov. Gavin Newsom (D) called for an independent investigation of the Los Angeles Department Water and Power on Friday amid reported water supply issues during this week’s … [+2072 chars]","sentences":{"prev":["a letter addressed to the CEO and chief engineer of the"],"next":["to content\r\nCalifornia Gov. Gavin Newsom (D) called for an"]}},"ABC’s David Muir returns to air with looser jacket after being mocked for 'vanity' with tailored look":{"cnt":1,"title":"ABC’s David Muir returns to air with looser jacket after being mocked for 'vanity' with tailored look","description":"ABC host David Muir made headlines once again for his fashion choices, ditching the clothespins he used the previous day to enhance his appearance on camera.","content":"ABC anchor David Muir made a noticeable change on Thursday night after being shredded for appearing to use clothespins to give his clothing a more form-fitted look while reporting from the scene of t… [+1563 chars]","sentences":{"prev":["he used the previous day to enhance his appearance on"],"next":["anchor David Muir made a noticeable change on Thursday"]}},"Mandy Moore tells critics to 'kindly F off' after backlash for sharing her family's fire relief fundraiser":{"cnt":1,"title":"Mandy Moore tells critics to 'kindly F off' after backlash for sharing her family's fire relief fundraiser","description":"Mandy Moore is hitting back at haters after receiving backlash for sharing her family's fire relief fundraiser on her Instagram. The actress lost most of her home in the Los Angeles wildfires.","content":"Mandy Moore is hitting back at haters questioning if she's financially helping her in-laws after they lost their home during the devastating Los Angeles wildfires.\r\nOn Thursday, the actress took to I… [+3592 chars]","sentences":{"prev":["The actress lost most of her home in the Los Angeles"],"next":["Moore is hitting back at haters questioning if she's"]}},"Will California Wildfires Delay A$AP Rocky Trial?":{"cnt":1,"title":"Will California Wildfires Delay A$AP Rocky Trial?","description":"The rapper's upcoming felony assault trial is still set for later this month in Los Angeles amid the deadly Southern California wildfires.","content":"Rapper A$AP Rocky's upcoming felony assault trial is still set for later this month in Los Angeles amid the Southern California wildfires, Newsweek can confirm.\r\nWhy It Matters\r\nA$AP Rocky, whose leg… [+3484 chars]","sentences":{"prev":["in Los Angeles amid the deadly Southern California"],"next":["A$AP Rocky's upcoming felony assault trial is still set"]}},"ThreeD Capital Inc. Announces Unaudited December 31, 2024 Net Asset Value Per Share – $0.76":{"cnt":1,"title":"ThreeD Capital Inc. Announces Unaudited December 31, 2024 Net Asset Value Per Share – $0.76","description":"TORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) — ThreeD Capital Inc. (“ThreeD” or the “Company”) (CSE:IDK / OTCQX:IDKFF) a Canadian-based venture capital firm focused on opportunistic investments in companies in the junior resources and disruptive technologies secto…","content":"TORONTO, Jan. 10, 2025 (GLOBE NEWSWIRE) ThreeD Capital Inc. (ThreeD or the Company) (CSE:IDK / OTCQX:IDKFF) a Canadian-based venture capital firm focused on opportunistic investments in companies in … [+5234 chars]","sentences":{"prev":["in the junior resources and disruptive technologies"],"next":["Jan. 10, 2025 (GLOBE NEWSWIRE) ThreeD Capital Inc."]}},"When Jensen Huang speaks, the market listens; if you are excited to invest in the tech world's next big bet then first listen to the Nvidia CEO":{"cnt":1,"title":"When Jensen Huang speaks, the market listens; if you are excited to invest in the tech world's next big bet then first listen to the Nvidia CEO","description":"Jensen Huang is currently one of the most followed tech CEO, especially after his company, Nvidia, became the shining knight in armor of the US stock market in 2024. Huang's vision has led Nvidia to become the market leader of the US stock market, and has giv…","content":"Artificial Intelligence(AI)\r\nAI and Analytics based Business Strategy\r\nBy - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence: ATCI\r\nView Program","sentences":{"prev":["become the market leader of the US stock market, and has"],"next":["Intelligence(AI)\r\nAI and Analytics based Business"]}},"Carney to Enter Race to Replace Trudeau as Canada Prime Minister":{"cnt":1,"title":"Carney to Enter Race to Replace Trudeau as Canada Prime Minister","description":"Former central banker Mark Carney is poised to announce that he’s jumping into the race to succeed Justin Trudeau as leader of the Liberal Party and Canadian prime minister.","content":"Carney is preparing an announcement for late next week now that the party has set out the rules of the contest, according to a person familiar with his plans, speaking on condition they not be identi… [+2024 chars]","sentences":{"prev":["as leader of the Liberal Party and Canadian prime"],"next":["is preparing an announcement for late next week now that"]}},"Another Arson Suspect Arrested as California Wildfires Spread":{"cnt":1,"title":"Another Arson Suspect Arrested as California Wildfires Spread","description":"Gloria Lynn Mandich, 60, was detained over an alleged connection with a brush fire near Leo Carrillo State Park in Los Angeles County.","content":"California State Parks announced Friday the arrest of Gloria Lynn Mandich, 60, in connection with a brush fire that ignited near Leo Carrillo State Park in Los Angeles County.\r\nNewsweek reached out t… [+4068 chars]","sentences":{"prev":["brush fire near Leo Carrillo State Park in Los Angeles"],"next":["State Parks announced Friday the arrest of Gloria"]}},"The Kardashians evacuate homes amid LA fires and donate meals to firefighters":{"cnt":1,"title":"The Kardashians evacuate homes amid LA fires and donate meals to firefighters","description":"As the Kenneth Fire raged across Los Angeles County, the Kardashian-Jenner family evacuated their Calabasas and Hidden Hills mansions, narrowly avoiding the devastating flames. The","content":"As the Kenneth Fire raged across Los Angeles County, the Kardashian-Jenner family evacuated their Calabasas and Hidden Hills mansions, narrowly avoiding the devastating flames. The fire, spanning 1,0… [+1983 chars]","sentences":{"prev":["Hills mansions, narrowly avoiding the devastating flames."],"next":["the Kenneth Fire raged across Los Angeles County, the"]}},"Greenland head says his people don't want to be Americans amid Trump interest":{"cnt":1,"title":"Greenland head says his people don't want to be Americans amid Trump interest","description":"Greenland's prime minister said he hasn't spoken to President-elect Donald Trump, but that he's open to discussions about what \"unites us.\"","content":"Greenland's prime minister said Friday that the mineral-rich Arctic territory's people don't want to be Americans, but that he understands U.S. President-elect Donald Trump's interest in the island g… [+3626 chars]","sentences":{"prev":["but that he's open to discussions about what \"unites"],"next":["prime minister said Friday that the mineral-rich"]}},"'Deeply disgusted': GOP senator shreds Biden admin in scathing letter on new immigrant deportation shield":{"cnt":1,"title":"'Deeply disgusted': GOP senator shreds Biden admin in scathing letter on new immigrant deportation shield","description":"GOP Sen. Bernie Moreno sent a blistering letter to the Biden administration after it announced it was extending deportation protection to hundreds of thousands of migrants.","content":"FIRST ON FOX: Newly sworn-in Sen. Bernie Moreno, R-Ohio, in his first letter as a member of the Senate, sent a blistering inquiry to the Department of Homeland Security demanding answers on the exten… [+4786 chars]","sentences":{"prev":["deportation protection to hundreds of thousands of"],"next":["ON FOX: Newly sworn-in Sen. Bernie Moreno, R-Ohio, in his"]}},"Trump's son Eric mulling new Trump vodka line":{"cnt":1,"title":"Trump's son Eric mulling new Trump vodka line","description":"Discussions about a new Trump-branded vodka centered on Eric Trump Wineries and an LLC that would use the Trump name under a license agreement, two sources said.","content":"Eric Trump has had discussions about launching a new line of Trump-branded vodka in the United States, according to people familiar with the matter, but it was unclear whether the deal would be final… [+2840 chars]","sentences":{"prev":["use the Trump name under a license agreement, two sources"],"next":["Trump has had discussions about launching a new line of"]}},"Official: Roma send Le Fee to Sunderland":{"cnt":1,"title":"Official: Roma send Le Fee to Sunderland","description":"Roma have officially sent Enzo Le Fée to Sunderland on loan with an option to buy that can become an obligation for €23m.","content":"Roma have officially sent Enzo Le Fée to Sunderland on loan with an option to buy that can become an obligation for 23m.\r\nThe midfielder had only been signed over the summer from Stade Rennais for 23… [+1472 chars]","sentences":{"prev":["with an option to buy that can become an obligation for"],"next":["have officially sent Enzo Le Fée to Sunderland on loan"]}},"Tamil Nadu seeks stricter penalty for crime against women":{"cnt":1,"title":"Tamil Nadu seeks stricter penalty for crime against women","description":"India News: Chennai: DMK government Friday introduced a bill to amend BNS and BNSS to increase the quantum of punishments in TN.","content":"9 exotic wild animals to see inside Kanha National Park, Madhya Pradesh","sentences":{"prev":["BNS and BNSS to increase the quantum of punishments in"],"next":["exotic wild animals to see inside Kanha National Park, Madhya"]}},"Guantanamo at 23: What’s next for the ‘lawless’ detention facility?":{"cnt":1,"title":"Guantanamo at 23: What’s next for the ‘lawless’ detention facility?","description":"With 15 inmates remaining, advocates urge Biden to release more Gitmo detainees before he leaves office on January 20.","content":"Washington, DC  The detention facility at Guantanamo Bay, Cuba, turns 23 on Saturday.\r\nFor Mansoor Adayfi, a former inmate at the prison, the anniversary marks 23 years of injustice, lawlessness, abu… [+5075 chars]","sentences":{"prev":["more Gitmo detainees before he leaves office on January"],"next":["DC  The detention facility at Guantanamo Bay, Cuba,"]}},"LA County cut fire budget while spending heavily on DEI, woke items: 'Midnight Stroll Transgender Cafe'":{"cnt":1,"title":"LA County cut fire budget while spending heavily on DEI, woke items: 'Midnight Stroll Transgender Cafe'","description":"A review of Los Angeles County's budget shows that thousands of dollars were allocated to diversity, equity and inclusion programs while the fire department saw major funding cuts.","content":"While Los Angeles officials were stripping millions in funding from their fire department ahead of one of the most destructive wildfires in state history, hundreds of thousands of dollars were alloca… [+3013 chars]","sentences":{"prev":["programs while the fire department saw major funding"],"next":["Los Angeles officials were stripping millions in funding"]}},"Tiger Woods in the middle of controversy after paid actors were in \"attendance\" for TGL":{"cnt":1,"title":"Tiger Woods in the middle of controversy after paid actors were in \"attendance\" for TGL","description":"As it prepares for a takeover of golf, recent revelations about the use of paid actors in the Tomorrow&apos;s Golf League (TGL) sparked a wave of speculation and debate within the","content":"As it prepares for a takeover of golf, recent revelations about the use of paid actors in the Tomorrow's Golf League (TGL) sparked a wave of speculation and debate within the sports community. Howeve… [+1965 chars]","sentences":{"prev":["(TGL) sparked a wave of speculation and debate within"],"next":["it prepares for a takeover of golf, recent revelations about"]}},"Meta's Chief Diversity Officer says the company's employee resource groups survive DEI cull: memo":{"cnt":1,"title":"Meta's Chief Diversity Officer says the company's employee resource groups survive DEI cull: memo","description":"Meta is the latest company to back away from diversity, equity and inclusion policies and goals.","content":"Meta Chief Diversity Officer Maxine Williams told staff in a memo on Friday that the company's decision to back off DEI efforts won't impact employee-resource groups, according to an internal post vi… [+1671 chars]","sentences":{"prev":["away from diversity, equity and inclusion policies and"],"next":["Chief Diversity Officer Maxine Williams told staff in a"]}},"Volunteer vets do 100 surgeries in week-long trip to remote NT":{"cnt":1,"title":"Volunteer vets do 100 surgeries in week-long trip to remote NT","description":"Fold-out tables in the open air become a surgery for volunteer vets who travel to remote Northern Territory communities to provide free life-saving services to pets.","content":"At plastic fold-out tables set up beneath the beating sun, a team of vets operates in the open air to give man's best friend a new lease on life.\r\nThey're multitasking shooing the flies away from the… [+5441 chars]","sentences":{"prev":["communities to provide free life-saving services to"],"next":["plastic fold-out tables set up beneath the beating sun, a"]}},"After boosting ties with Delhi, Male hosts Beijing minister":{"cnt":1,"title":"After boosting ties with Delhi, Male hosts Beijing minister","description":"South Asia News: After back-to-back visits to India by its foreign and defence ministers, Maldives hosted Chinese foreign minister Wang Yi Friday with President Mohame.","content":"9 exotic wild animals to see inside Kanha National Park, Madhya Pradesh","sentences":{"prev":["Chinese foreign minister Wang Yi Friday with President"],"next":["exotic wild animals to see inside Kanha National Park, Madhya"]}},"Alexander Vindman Slams Mike Waltz Plan to Clear Deep Staters from National Security Council":{"cnt":1,"title":"Alexander Vindman Slams Mike Waltz Plan to Clear Deep Staters from National Security Council","description":"Alexander Vindman criticized incoming National Security Adviser Mike Waltz's plan to clear the National Security Council of deep staters.\nThe post Alexander Vindman Slams Mike Waltz Plan to Clear Deep Staters from National Security Council appeared first on B…","content":"Retired Lt. Col. Alexander Vindman criticized incoming National Security Adviser Mike Waltz’s plan to clear out each “intelligence official” serving in “various departments and agencies” throughout t… [+3177 chars]","sentences":{"prev":["Staters from National Security Council appeared first on"],"next":["Lt. Col. Alexander Vindman criticized incoming National"]}},"MLB Rumors: Pete Alonso's Camp Offered Mets 3-Year Contract in FA amid Giants Buzz":{"cnt":1,"title":"MLB Rumors: Pete Alonso's Camp Offered Mets 3-Year Contract in FA amid Giants Buzz","description":"Pete Alonso appears to be willing to bend the knee a little bit in order to stay with the New York Mets. Jim Duquette of SiriusXM reported that the first…","content":"Daniel Shirey/MLB Photos via Getty Images\r\nPete Alonso appears to be willing to bend the knee a little bit in order to stay with the New York Mets.\r\nJim Duquette of SiriusXM reported that the first b… [+1456 chars]","sentences":{"prev":["York Mets. Jim Duquette of SiriusXM reported that the"],"next":["Shirey/MLB Photos via Getty Images\r\nPete Alonso appears"]}},"Fire-ravaged Los Angeles weighing on Kings' minds before road game against Jets in Winnipeg":{"cnt":1,"title":"Fire-ravaged Los Angeles weighing on Kings' minds before road game against Jets in Winnipeg","description":"The Los Angeles Kings were thinking about friends and family in wildfire-ravaged California as they embarked on an eight-day road trip that kicked off Friday in Winnipeg.","content":"The Los Angeles Kings were thinking about friends and family in wildfire-ravaged California as they embarked on an eight-day road trip that kicked off Friday in Winnipeg.\r\nIt has been tough for playe… [+3014 chars]","sentences":{"prev":["on an eight-day road trip that kicked off Friday in"],"next":["Los Angeles Kings were thinking about friends and family in"]}},"Why are nuclear stocks in bullish territory in the US market; here's the catch":{"cnt":1,"title":"Why are nuclear stocks in bullish territory in the US market; here's the catch","description":"Nuclear stocks are performing exceeding well at the US stock market, and there are chances that it may keep showing a bullish trend for some time into 2025. Nuclear power stocks are currently in great demand and things are looking quite promising at the moment","content":"Artificial Intelligence(AI)\r\nAI and Analytics based Business Strategy\r\nBy - Tanusree De, Managing Director- Accenture Technology Lead, Trustworthy AI Center of Excellence: ATCI\r\nView Program","sentences":{"prev":["demand and things are looking quite promising at the"],"next":["Intelligence(AI)\r\nAI and Analytics based Business"]}},"These solo tabletop RPGs will break your heart and put it back together":{"cnt":1,"title":"These solo tabletop RPGs will break your heart and put it back together","description":"For at least the last decade, video games have been offering profound emotional single-player experiences, yet the recent surge of solo tabletop role-playing games has shown that pen & paper RPGs can be just as heartbreaking — if not more.  Traditionally, tab…","content":"For at least the last decade, video games have been offering profound emotional single-player experiences, yet the recent surge of solo tabletop role-playing games has shown that pen & paper RPGs can… [+3457 chars]","sentences":{"prev":["be just as heartbreaking — if not more.  Traditionally,"],"next":["at least the last decade, video games have been offering"]}},"Christian student leaders' Israel trip strengthens interfaith bonds amid crisis":{"cnt":1,"title":"Christian student leaders' Israel trip strengthens interfaith bonds amid crisis","description":"A Hanukkah journey with Passages Israel program participants offered profound insights into Christian-Jewish solidarity while experiencing firsthand the realities of life under Hamas threats.","content":"Embarking on a journey with Christian student leaders from Passages Israel over the Hanukkah holiday was an eye-opening experience, reinforcing for me the profound connection between the Christian fa… [+3596 chars]","sentences":{"prev":["firsthand the realities of life under Hamas"],"next":["on a journey with Christian student leaders from"]}},"Redick: Lakers want to play, 'give people hope'":{"cnt":1,"title":"Redick: Lakers want to play, 'give people hope'","description":"Lakers coach JJ Redick says he hopes Saturday's game against the Spurs will be played as scheduled, giving the people of Los Angeles 'hope' in the wake of recent wildfires.","content":"EL SEGUNDO, Calif. -- Los Angeles Lakers coach JJ Redick fought back tears Friday, grieving not only the loss of his family's home - reduced to rubble from the Palisades Fire that remains active and … [+4701 chars]","sentences":{"prev":["people of Los Angeles 'hope' in the wake of recent"],"next":["SEGUNDO, Calif. -- Los Angeles Lakers coach JJ Redick fought"]}},"Mustang Energy Acquires Additional Land Holdings in the Eastern Athabasca Basin, Saskatchewan":{"cnt":1,"title":"Mustang Energy Acquires Additional Land Holdings in the Eastern Athabasca Basin, Saskatchewan","description":"VANCOUVER, British Columbia, Jan. 10, 2025 (GLOBE NEWSWIRE) — Mustang Energy Corp. (CSE: MEC, OTC:MECPF, FRA:92T) (the “Company” or “Mustang”) is pleased to announce the acquisition of the Königsstuhl Project, a 5,228 hectare property located in the Eastern A…","content":"Author of the article:\r\nOverview of Mustang Energy's newly acquired claims Königsstuhl Project 7,1GNW\r\nArticle content\r\nVANCOUVER, British Columbia, Jan. 10, 2025 (GLOBE NEWSWIRE) Mustang Energy Corp… [+14167 chars]","sentences":{"prev":["Project, a 5,228 hectare property located in the Eastern"],"next":["of the article:\r\nOverview of Mustang Energy's newly"]}},"FDA finds little handwashing, dirty equipment at McDonald's supplier linked to outbreak":{"cnt":1,"title":"FDA finds little handwashing, dirty equipment at McDonald's supplier linked to outbreak","description":"More than a hundred E. coli cases were linked to contaminated onions produced by Taylor Farms used in McDonald's burgers.","content":"Food and Drug Administration officials turned up dozens of violations at a McDonald's supplier linked to a deadly outbreak of E. coli that led to more than a hundred infections and a sweeping recall … [+4021 chars]","sentences":{"prev":["onions produced by Taylor Farms used in McDonald's"],"next":["and Drug Administration officials turned up dozens of"]}},"Biden Extends Migrant Protection Programs Trump Promised to End":{"cnt":1,"title":"Biden Extends Migrant Protection Programs Trump Promised to End","description":"A Trump spokesperson vowed the president-elect \"will deliver,\" despite the outgoing administration's decision.","content":"The Biden administration announced Friday an extension of Temporary Protected Status (TPS) for immigrants from several countries, allowing hundreds of thousands of people to remain legally in the Uni… [+5562 chars]","sentences":{"prev":["\"will deliver,\" despite the outgoing administration's"],"next":["Biden administration announced Friday an extension of"]}},"NFL Draft prospect Kyren Lacy wanted for negligent homicide for alleged role in fatal hit-and-run":{"cnt":1,"title":"NFL Draft prospect Kyren Lacy wanted for negligent homicide for alleged role in fatal hit-and-run","description":"Police in Louisiana have issued an arrest warrant for LSU receiver and NFL Draft prospect Kyren Lacy after he allegedly fled a fatal hit-and-run.","content":"Police in Louisiana have issued an arrest warrant for LSU receiver and NFL Draft prospect Kyren Lacy for negligent homicide after police allege he fled a deadly car crash last month. \r\nLouisiana Stat… [+2463 chars]","sentences":{"prev":["Kyren Lacy after he allegedly fled a fatal"],"next":["in Louisiana have issued an arrest warrant for LSU"]}},"Jai Opetaia vs Gilberto Ramirez, a strange southpaw battle that promises a great fight":{"cnt":1,"title":"Jai Opetaia vs Gilberto Ramirez, a strange southpaw battle that promises a great fight","description":"Boxing purists raise an eyebrow when they see a southpaw in the ring, but they lose their temper when there are two of them facing each other. That&apos;s why the phrase exists: &q","content":"Boxing purists raise an eyebrow when they see a southpaw in the ring, but they lose their temper when there are two of them facing each other. That's why the phrase exists: \"The only thing worse than… [+2253 chars]","sentences":{"prev":["them facing each other. That&apos;s why the phrase exists:"],"next":["purists raise an eyebrow when they see a southpaw in the"]}},"Inter ready for daring Donnarumma swoop from PSG":{"cnt":1,"title":"Inter ready for daring Donnarumma swoop from PSG","description":"Sky Sport Italia suggest Inter are preparing a potentially shocking swoop for Italy goalkeeper Gianluigi Donnarumma from Paris Saint-Germain.","content":"Sky Sport Italia suggest Inter are preparing a potentially shocking swoop for Italy goalkeeper Gianluigi Donnarumma from Paris Saint-Germain.\r\nA return to Serie A has been suggested before for Juvent… [+1224 chars]","sentences":{"prev":["Italy goalkeeper Gianluigi Donnarumma from Paris"],"next":["Sport Italia suggest Inter are preparing a potentially"]}},"[Removed]":{"cnt":1,"title":"[Removed]","description":"[Removed]","content":"[Removed]","sentences":{"prev":[],"next":[]},"prompt":"\"Generate an image depicting theMicrosoft lawsuit against a group who developed tools to abuse the safety guardrails of Microsoft's cloud AI products. Show a room with hackers typing on computers, with a large screen in the background showing various AI service interfaces and a Microsoft logo on it, and a notification of the ongoing lawsuit displayed on the screen.\""}},"usedLinks":{"Microsoft accuses group of developing tool to abuse its AI service in new lawsuit":{"cnt":1},"Supreme Court to weigh reinstating Obamacare care requirements struck down by lower court":{"cnt":1},"Sabres vs. Kraken January 11: Injured players, inactives, latest updates":{"cnt":1},"Penguins vs. Senators January 11: Injured players, inactives, latest updates":{"cnt":1},"Panthers vs. Bruins January 11: Injured players, inactives, latest updates":{"cnt":1},"B.C. sending firefighting team to California as premier gears up for trip to U.S. to fight tariff threat":{"cnt":1},"Notre Dame's Watts: Marcus Freeman Was 'Angry' After James Franklin's Presser Remarks":{"cnt":1},"New fears that strong winds will keep fueling Los Angeles wildfires":{"cnt":1},"What happened during Trump's \"hush money\" sentencing":{"cnt":1}}}